; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v2 ?v5)
             (pred_9 ?v13 ?v6)
             (pred_10 ?v2 ?v6)
             (pred_5 ?v4 ?v2 )
	     (pred_4 ?v2)
             (pred_6 ?v10)
             (pred_2 ?v13)
             (pred_12 ?v6)
             (pred_8 ?v2)
             (pred_11 ?v13)
             (pred_1 ?v2)
             (pred_3 ))



(:action op_2
:parameters (?v11 ?v8 ?v1 ?v3)
:precondition (and (pred_6 ?v11) (pred_6 ?v8) (pred_2 ?v1) (pred_12 ?v3)
          (pred_7 ?v11 ?v8) (pred_9 ?v1 ?v3)
                   (pred_10 ?v8 ?v3) (pred_4 ?v11) 
                   (pred_8 ?v8) (pred_11 ?v1))
:effect (and  (pred_1 ?v8) (not (pred_8 ?v8))))


(:action op_3
:parameters (?v11 ?v9)
:precondition (and (pred_6 ?v11) (pred_6 ?v9)
               (pred_4 ?v11) (pred_7 ?v11 ?v9) (pred_1 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v11))))

(:action op_5
:parameters (?v11 ?v1)
:precondition (and (pred_6 ?v11) (pred_2 ?v1) 
                  (pred_4 ?v11) (pred_5 ?v1 ?v11) (pred_3 ))
:effect (and (pred_11 ?v1)
   (not (pred_5 ?v1 ?v11)) (not (pred_3 ))))


(:action op_1
:parameters (?v11 ?v12 ?v7)
:precondition (and (pred_6 ?v11) (pred_2 ?v12) (pred_2 ?v7)
                  (pred_4 ?v11) (pred_11 ?v7) (pred_5 ?v12 ?v11))
:effect (and (pred_11 ?v12) (pred_5 ?v7 ?v11)
        (not (pred_11 ?v7)) (not (pred_5 ?v12 ?v11))))

(:action op_4
:parameters (?v11 ?v1)
:precondition (and (pred_6 ?v11) (pred_2 ?v1) 
                  (pred_4 ?v11) (pred_11 ?v1))
:effect (and (pred_3 ) (pred_5 ?v1 ?v11) (not (pred_11 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_27 obj_28 obj_12 obj_15 obj_07 obj_01 obj_19 obj_21 obj_09 obj_04 obj_11 obj_06 obj_24 obj_03 obj_08 obj_16 obj_22 obj_05 obj_10 obj_25 obj_20 obj_18 obj_17 obj_13
    obj_29 obj_14
    obj_02 obj_23 obj_26
    )

    (:init
       (pred_3)

       (pred_6 obj_30)
       (pred_6 obj_27)
       (pred_6 obj_28)
       (pred_6 obj_12)
       (pred_6 obj_15)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_19)
       (pred_6 obj_21)
       (pred_6 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_11)
       (pred_6 obj_06)
       (pred_6 obj_24)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_16)
       (pred_6 obj_22)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_25)
       (pred_6 obj_20)
       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_12 obj_29)
       (pred_12 obj_14)
       (pred_2 obj_02)
       (pred_2 obj_23)
       (pred_2 obj_26)

       (pred_7 obj_30 obj_07)
       (pred_7 obj_30 obj_27)
       (pred_7 obj_27 obj_01)
       (pred_7 obj_27 obj_28)
       (pred_7 obj_27 obj_30)
       (pred_7 obj_28 obj_19)
       (pred_7 obj_28 obj_12)
       (pred_7 obj_28 obj_27)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_12 obj_15)
       (pred_7 obj_12 obj_28)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_15 obj_12)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_30)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_27)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_19 obj_06)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_19 obj_28)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_21 obj_24)
       (pred_7 obj_21 obj_09)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_21)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_06 obj_24)
       (pred_7 obj_06 obj_19)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_24 obj_05)
       (pred_7 obj_24 obj_03)
       (pred_7 obj_24 obj_21)
       (pred_7 obj_24 obj_06)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_24)
       (pred_7 obj_08 obj_25)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_16 obj_22)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_16 obj_08)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_22 obj_05)
       (pred_7 obj_22 obj_06)
       (pred_7 obj_22 obj_16)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_05 obj_24)
       (pred_7 obj_05 obj_22)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_10 obj_05)
       (pred_7 obj_25 obj_20)
       (pred_7 obj_25 obj_08)
       (pred_7 obj_20 obj_18)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_25)
       (pred_7 obj_18 obj_17)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_18 obj_20)
       (pred_7 obj_17 obj_13)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_17 obj_18)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_13 obj_17)
       (pred_8 obj_30)
       (pred_8 obj_28)
       (pred_8 obj_08)
       (pred_10  obj_30 obj_29)
       (pred_10  obj_28 obj_14)
       (pred_10  obj_08 obj_14)
       (pred_1 obj_27)
       (pred_1 obj_12)
       (pred_1 obj_15)
       (pred_1 obj_07)
       (pred_1 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_21)
       (pred_1 obj_09)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_06)
       (pred_1 obj_24)
       (pred_1 obj_03)
       (pred_1 obj_16)
       (pred_1 obj_22)
       (pred_1 obj_05)
       (pred_1 obj_10)
       (pred_1 obj_25)
       (pred_1 obj_20)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_13)

       (pred_9  obj_02 obj_29)
       (pred_9  obj_23 obj_14)
       (pred_9  obj_26 obj_29)
       (pred_5 obj_02 obj_11)
       (pred_5 obj_23 obj_27)
       (pred_5 obj_26 obj_05)
       (pred_4 obj_18)
    )

    (:goal (and
       (pred_5 obj_02 obj_01)
    ))
(:constraints
  (always (not (pred_4 obj_22)))
)
)

; plan
1. (op_3 obj_18 obj_20)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_16)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_16)
   goals met: 0 of 1
3. (op_3 obj_16 obj_11)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_02)
   deleted: (pred_5 obj_02 obj_11) (pred_3)
   added: (pred_11 obj_02)
   goals met: 0 of 1
5. (op_3 obj_11 obj_01)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_01)
   goals met: 0 of 1
6. (op_4 obj_01 obj_02)
   deleted: (pred_11 obj_02)
   added: (pred_3) (pred_5 obj_02 obj_01)
   goals met: 1 of 1
